Tekla.Structures.ModelInternal.SpiralNode.#ctor(Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,System.Double,System.Double,System.Double,System.Double)
Initializes a new instance of the SpiralNode class.
startPoint: The starting point of the spiral.
rotationAxisBasePoint: The first definition point of the spiral rotation axis.
rotationAxisUpPoint: The first definition point of the spiral rotation axis.
totalRise: Difference in rotation axis direction between the start and end point of the spiral.
rotationAngle: Rotation angle of the spiral, in degrees.
twistAngleStart: Twist angle angle at the spiral start, in degrees.
twistAngleEnd: Twist angle at the spiral end, in degrees.